Extensions/ИнтеграцияGreenApi/Catalogs/iga_Алгоритмы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>iga_Алгоритмы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Алгоритм</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяАлгоритма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверочныйКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыАлгоритма</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/Catalogs/iga_Алгоритмы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОбновитьСписокПараметров(ТекстАлгоритма)
	
	Если ПустаяСтрока(ТекстАлгоритма) Тогда
		Возврат;
	КонецЕсли;
	
	// 1. Используем регулярное выражение для поиска текста в фигурных скобках
	// Шаблон \{([^}]+)\} означает: найти "{", захватить всё, что не является "}", и найти "}"
	RegExp = Новый COMОбъект("VBScript.RegExp");
	RegExp.IgnoreCase = Истина; // Игнорировать регистр
	RegExp.Global     = Истина; // Искать все вхождения
	RegExp.MultiLine  = Истина;
	RegExp.Pattern    = "\{([^}]+)\}";
	
	Попытка
		Matches = RegExp.Execute(ТекстАлгоритма);
	Исключение
		Сообщить("Ошибка при разборе текста алгоритма: " + ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	// 2. Проходим по всем найденным совпадениям
	Для Каждого Match Из Matches Цикл
		
		// Получаем имя параметра без скобок (это первая подгруппа в регулярке)
		ИмяИзТекста = Match.SubMatches(0);
		
		// 3. Проверяем, есть ли уже такой параметр в таблице
		// Используем НайтиСтроки, чтобы не плодить дубли
		ПараметрыОтбора = Новый Структура("ИмяПараметра", ИмяИзТекста);
		НайденныеСтроки = Объект.ПараметрыАлгоритма.НайтиСтроки(ПараметрыОтбора);
		
		// Если строк не найдено — добавляем новую
		Если НайденныеСтроки.Количество() = 0 Тогда
			НоваяСтрока = Объект.ПараметрыАлгоритма.Добавить();
			НоваяСтрока.ИмяПараметра = ИмяИзТекста;
		КонецЕсли;
		
	КонецЦикла;
	
	// Параметры, которых нет в алгоритме, но есть в таблице, 
	// по твоему условию остаются без изменений, поэтому мы их не трогаем.

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПараметры(Команда)
	ОкноБраузера = Элементы.Алгоритм.Документ.defaultView;
	
	КодОбработки = ОкноБраузера.get1CCode();
	ОбновитьСписокПараметров(КодОбработки);
КонецПроцедуры


&НаСервере
Функция ПроверитьНаСервере(КодОбработки)
    // Массив для хранения стека вызовов (нужен для защиты от бесконечного цикла)
    СтекВызовов = Новый Массив;
    
	
	Обработчик = Обработки.iga_ОбработчикЭтапов.Создать();
	
    Возврат Обработчик.ВычислитьАлгоритм(КодОбработки, Объект.ПараметрыАлгоритма, СтекВызовов, Объект.Ссылка);
КонецФункции

&НаКлиенте
Процедура Проверить(Команда)
	
	Попытка
		
		ОкноБраузера = Элементы.Алгоритм.Документ.defaultView;
		
		КодОбработки = ОкноБраузера.get1CCode();
		
		КодОбработки = Объект.ПроверочныйКод + Символы.ПС + КодОбработки;
		
        РезультатВыполнения = ПроверитьНаСервере(КодОбработки);
		ВвестиСтрокуАсинх(Строка(РезультатВыполнения), "Алгоритм выполнен успешно!", 1000, Истина);
    Исключение
        Сообщить("Ошибка при выполнении: " + ОписаниеОшибки());
    КонецПопытки;

КонецПроцедуры

&НаКлиенте
Процедура Вставить(Команда)
	
	ТекущаяСтрока = Элементы.ПараметрыАлгоритма.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВставляемыйТекст = "{" + Элементы.ПараметрыАлгоритма.ТекущиеДанные.ИмяПараметра + "}";
	
	ОкноБраузера = Элементы.Алгоритм.Документ.defaultView;
	
	Если ОкноБраузера <> Неопределено Тогда
		// Вызываем нашу новую JS-функцию и передаем туда текст
		ОкноБраузера.insert1CCodeAtCursor(ВставляемыйТекст);
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	Объект.ИмяАлгоритма = НРег(СформироватьИмяПеременной(Объект.Наименование));
КонецПроцедуры

// Преобразует произвольную строку в строку, пригодную для имени переменной/реквизита.
//
// Параметры:
//  ИсходнаяСтрока - Строка - Например, "Наименование клиента (полное)"
//
// Возвращаемое значение:
//  Строка - Валидный идентификатор (н-р, "НаименованиеКлиентаПолное")
//
Функция СформироватьИмяПеременной(Знач ИсходнаяСтрока) Экспорт
	
	// 1. Убираем лишние пробелы по краям
	Результат = СокрЛП(ИсходнаяСтрока);
	
	// 2. Определяем алфавит допустимых символов (буквы, цифры и подчеркивание)
	ДопустимыеСимволы = "abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZабвгдеёжзийклмнопрстуфхцчшщъыьэюяАБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ0123456789_";
	
	ОчищеннаяСтрока = "";
	СледующаяЗаглавная = Ложь;
	
	Для Поз = 1 По СтрДлина(Результат) Цикл
		
		Символ = Сред(Результат, Поз, 1);
		
		Если СтрНайти(ДопустимыеСимволы, Символ) > 0 Тогда
			// Если прошлый символ был разделителем, делаем текущую букву заглавной (CamelCase)
			Если СледующаяЗаглавная Тогда
				ОчищеннаяСтрока = ОчищеннаяСтрока + ВРег(Символ);
				СледующаяЗаглавная = Ложь;
			Иначе
				ОчищеннаяСтрока = ОчищеннаяСтрока + Символ;
			КонецЕсли;
		Иначе
			// Спецсимволы и пробелы считаем разделителями слов
			СледующаяЗаглавная = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	// 3. Имя переменной не может начинаться с цифры
	Если СтрДлина(ОчищеннаяСтрока) > 0 Тогда
		ПервыйСимвол = Лев(ОчищеннаяСтрока, 1);
		Если СтрНайти("0123456789", ПервыйСимвол) > 0 Тогда
			ОчищеннаяСтрока = "_" + ОчищеннаяСтрока;
		КонецЕсли;
	КонецЕсли;
	
	// 4. Если в итоге получилась пустая строка, даем стандартное имя
	Если ПустаяСтрока(ОчищеннаяСтрока) Тогда
		ОчищеннаяСтрока = "ИмяПеременной";
	КонецЕсли;
	
	Возврат ОчищеннаяСтрока;
	
КонецФункции

&НаКлиенте
Процедура ИмяАлгоритмаПриИзменении(Элемент)
	Объект.ИмяАлгоритма = СокрЛП(НРег(Объект.ИмяАлгоритма));
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	    
	Алгоритм = Обработки.iga_ОбработчикЭтапов.ПолучитьТекстПоляРедактораКода();

КонецПроцедуры

&НаКлиенте
Процедура АлгоритмДокументСформирован(Элемент)
    
    ОкноБраузера = Элементы.Алгоритм.Документ.defaultView;
    
    Если ОкноБраузера <> Неопределено Тогда
        ОкноБраузера.set1CCode(Объект.Алгоритм);
    КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ОкноБраузера = Элементы.Алгоритм.Документ.defaultView;
	
	КодОбработки = ОкноБраузера.get1CCode();
	Объект.Алгоритм = КодОбработки;

КонецПроцедуры

&НаКлиенте
Процедура ВставитьПоле(Команда)
	ОткрытьФорму("Справочник.iga_Алгоритмы.Форма.ФормаДереваМетаданных",, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Асинх Процедура ФорматнаяСтрока(Команда)
	
	КФС = Новый КонструкторФорматнойСтроки;
	Результат = Ждать КФС.ОткрытьАсинх();
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОкноБраузера = Элементы.Алгоритм.Документ.defaultView;
	
	Если ОкноБраузера <> Неопределено Тогда
		// Вызываем нашу новую JS-функцию и передаем туда текст
		ОкноБраузера.insert1CCodeAtCursor("""" + Результат + """");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Обработчик_ПослеЗаданияПроверочногоКода(ПроверочныйКод, ДопПараметры) Экспорт
	
	Если ПроверочныйКод = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ПроверочныйКод = ПроверочныйКод;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадатьПроверочныйКод(Команда)
	
	ОкноБраузера = Элементы.Алгоритм.Документ.defaultView;
	
	КодОбработки = ОкноБраузера.get1CCode();
	
	ОписаниеОповещения = Новый ОписаниеОповещения("Обработчик_ПослеЗаданияПроверочногоКода", ЭтаФорма);
	ОткрытьФорму("Справочник.iga_Алгоритмы.Форма.ФормаПроверкиАлгоритма", 
		Новый Структура("ПроверочныйКод, ИсходныйТекст", Объект.ПроверочныйКод, КодОбработки),
		ЭтаФорма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьСсылку(Команда)
	
	iga_УниверсальныеОбработчикиНаКлиенте.ВставитьСсылку(ЭтаФорма, Элементы.Алгоритм);
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьТекстЗапроса(Команда)
	iga_УниверсальныеОбработчикиНаКлиенте.ВставитьТекстЗапроса(ЭтаФорма, Элементы.Алгоритм);
КонецПроцедуры

&НаКлиенте
Процедура ВставитьПроверкуНаСпецМетку(Команда)
	
	iga_УниверсальныеОбработчикиНаКлиенте.ВставитьПроверкуНаСпецМетку(ЭтаФорма, Элементы.Алгоритм);

КонецПроцедуры
